app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.reverse

INSERT INTO "posts" ("created_at", "email", "message", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 02 Jun 2014 00:05:48 UTC +00:00], ["email", ""], ["message", ""], ["name", ""], ["updated_at", Mon, 02 Jun 2014 00:05:48 UTC +00:00]]
---
  def create
    if post_params[:no_data].blank? && post_params[:hexy] == Digest::MD5.hexdigest(Date.today.day.to_s + Time.now.hour.to_s)
      real_data = post_params.reject!{ |k| k == 'no_data' || k == 'hexy' }
      @post = Post.new(real_data)

      respond_to do |format|
        if @post.save