app/controllers/rsvps_controller.rb

SELECT "rsvps".* FROM "rsvps"
---
  def index
    @rsvps = Rsvp.all

INSERT INTO "rsvps" ("created_at", "invited_guest_name", "meal", "plus_one_name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 02 Jun 2014 02:15:57 UTC +00:00], ["invited_guest_name", "Krista"], ["meal", "Beef"], ["plus_one_name", ""], ["updated_at", Mon, 02 Jun 2014 02:15:57 UTC +00:00]]
---
  def create
    @rsvp = Rsvp.new(rsvp_params)

    respond_to do |format|
      if @rsvp.valid? && @rsvp.save!